Homework 1:

import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

1.Rename column names using function. "First Name" --> "first_name", "Age" --> "age
2.Print the first 3 rows of the DataFrame
3.Find the mean age of the individuals
4.Select and print only the 'Name' and 'City' columns
5.Add a new column 'Salary' with random salary values
6.Display summary statistics of the DataFrame

In [1]:
import pandas as pd

In [9]:
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data) 
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [11]:
#1.Rename column names using function. "First Name" --> "first_name", "Age" --> "age
renamed_col={"First Name":"fisrt_name","Age":"age"}

df.rename(columns=renamed_col).head()

  fisrt_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [14]:
#2.Print the first 3 rows of the DataFrame
df.head(3)

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [24]:
#3.Find the mean age of the individuals
meaned_age=df.Age.mean()
print(meaned_age)

32.5

In [31]:
#4.Select and print only the 'Name' and 'City' columns
selected_col=df[['First Name','City']]
selected_col

  First Name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [33]:
#5.Add a new column 'Salary' with random salary values
import numpy as np

np.random.seed(42)
df['Salary']=np.random.randint(1,10,size=len(df))
print(df)

  First Name  Age           City  Salary
0      Alice   25       New York       7
1        Bob   30  San Francisco       4
2    Charlie   35    Los Angeles       8
3      David   40        Chicago       5

In [34]:
#6.Display summary statistics of the DataFrame 
print(df.describe())

             Age    Salary
count   4.000000  4.000000
mean   32.500000  6.000000
std     6.454972  1.825742
min    25.000000  4.000000
25%    28.750000  4.750000
50%    32.500000  6.000000
75%    36.250000  7.250000
max    40.000000  8.000000

In [36]:
print(df.describe(include='all'))

       First Name        Age      City    Salary
count           4   4.000000         4  4.000000
unique          4        NaN         4       NaN
top         Alice        NaN  New York       NaN
freq            1        NaN         1       NaN
mean          NaN  32.500000       NaN  6.000000
std           NaN   6.454972       NaN  1.825742
min           NaN  25.000000       NaN  4.000000
25%           NaN  28.750000       NaN  4.750000
50%           NaN  32.500000       NaN  6.000000
75%           NaN  36.250000       NaN  7.250000
max           NaN  40.000000       NaN  8.000000